Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAMV70Q20.xml
        <register caption="AFEC Temperature Sensor Mode Register" name="AFEC_TEMPMR" offset="0x70" rw="RW" size="4">
          <bitfield caption="Temperature Sensor RTC Trigger Mode" mask="0x00000001" name="RTCT"/>
          <bitfield caption="Temperature Comparison Mode" mask="0x00000030" name="TEMPCMPMOD" values="AFEC_TEMPMR__TEMPCMPMOD"/>
        </register>
        <register caption="AFEC Temperature Compare Window Register" name="AFEC_TEMPCWR" offset="0x74" rw="RW" size="4">
          <bitfield caption="Temperature Low Threshold" mask="0x0000FFFF" name="TLOWTHRES"/>
          <bitfield caption="Temperature High Threshold" mask="0xFFFF0000" name="THIGHTHRES"/>
        </register>
        <register caption="AFEC Analog Control Register" name="AFEC_ACR" offset="0x94" rw="RW" size="4">
          <bitfield caption="PGA0 Enable" mask="0x00000004" name="PGA0EN"/>
          <bitfield caption="PGA1 Enable" mask="0x00000008" name="PGA1EN"/>
          <bitfield caption="AFE Bias Current Control" mask="0x00000300" name="IBCTL"/>
        </register>
        <register caption="AFEC Sample &amp; Hold Mode Register" name="AFEC_SHMR" offset="0xA0" rw="RW" size="4">
          <bitfield caption="Dual Sample &amp; Hold for channel 0" mask="0x00000001" name="DUAL0"/>
          <bitfield caption="Dual Sample &amp; Hold for channel 1" mask="0x00000002" name="DUAL1"/>
          <bitfield caption="Dual Sample &amp; Hold for channel 2" mask="0x00000004" name="DUAL2"/>
          <bitfield caption="Dual Sample &amp; Hold for channel 3" mask="0x00000008" name="DUAL3"/>
          <bitfield caption="Dual Sample &amp; Hold for channel 4" mask="0x00000010" name="DUAL4"/>
          <bitfield caption="Dual Sample &amp; Hold for channel 5" mask="0x00000020" name="DUAL5"/>
          <bitfield caption="Dual Sample &amp; Hold for channel 6" mask="0x00000040" name="DUAL6"/>
          <bitfield caption="Dual Sample &amp; Hold for channel 7" mask="0x00000080" name="DUAL7"/>
          <bitfield caption="Dual Sample &amp; Hold for channel 8" mask="0x00000100" name="DUAL8"/>
          <bitfield caption="Dual Sample &amp; Hold for channel 9" mask="0x00000200" name="DUAL9"/>
          <bitfield caption="Dual Sample &amp; Hold for channel 10" mask="0x00000400" name="DUAL10"/>
          <bitfield caption="Dual Sample &amp; Hold for channel 11" mask="0x00000800" name="DUAL11"/>
        </register>
        <register caption="AFEC Correction Select Register" name="AFEC_COSR" offset="0xD0" rw="RW" size="4">
          <bitfield caption="Sample &amp; Hold unit Correction Select" mask="0x00000001" name="CSEL"/>
        </register>
        <register caption="AFEC Correction Values Register" name="AFEC_CVR" offset="0xD4" rw="RW" size="4">
          <bitfield caption="Offset Correction" mask="0x0000FFFF" name="OFFSETCORR"/>
          <bitfield caption="Gain Correction" mask="0xFFFF0000" name="GAINCORR"/>
        </register>
        <register caption="AFEC Channel Error Correction Register" name="AFEC_CECR" offset="0xD8" rw="RW" size="4">
          <bitfield caption="Error Correction Enable for channel 0" mask="0x00000001" name="ECORR0"/>
          <bitfield caption="Error Correction Enable for channel 1" mask="0x00000002" name="ECORR1"/>
          <bitfield caption="Error Correction Enable for channel 2" mask="0x00000004" name="ECORR2"/>
          <bitfield caption="Error Correction Enable for channel 3" mask="0x00000008" name="ECORR3"/>
          <bitfield caption="Error Correction Enable for channel 4" mask="0x00000010" name="ECORR4"/>
          <bitfield caption="Error Correction Enable for channel 5" mask="0x00000020" name="ECORR5"/>
          <bitfield caption="Error Correction Enable for channel 6" mask="0x00000040" name="ECORR6"/>
          <bitfield caption="Error Correction Enable for channel 7" mask="0x00000080" name="ECORR7"/>
          <bitfield caption="Error Correction Enable for channel 8" mask="0x00000100" name="ECORR8"/>
          <bitfield caption="Error Correction Enable for channel 9" mask="0x00000200" name="ECORR9"/>
          <bitfield caption="Error Correction Enable for channel 10" mask="0x00000400" name="ECORR10"/>
          <bitfield caption="Error Correction Enable for channel 11" mask="0x00000800" name="ECORR11"/>
        </register>
        <register caption="AFEC Write Protection Mode Register" name="AFEC_WPMR" offset="0xE4" rw="RW" size="4">
          <bitfield caption="Write Protection Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protect KEY" mask="0xFFFFFF00" name="WPKEY" values="AFEC_WPMR__WPKEY"/>
        </register>
        <register caption="AFEC Write Protection Status Register" name="AFEC_WPSR" offset="0xE8" rw="R" size="4">
          <bitfield caption="Write Protect Violation Status" mask="0x00000001" name="WPVS"/>
          <bitfield caption="Write Protect Violation Source" mask="0x00FFFF00" name="WPVSRC"/>
        </register>
        <register caption="AFEC Version Register" name="AFEC_VERSION" offset="0xFC" rw="R" size="4">
          <bitfield caption="Version of the Hardware Module" mask="0x00000FFF" name="VERSION"/>
          <bitfield caption="Metal Fix Number" mask="0x00070000" name="MFN"/>
        </register>
      </register-group>
      <value-group caption="" name="AFEC_MR__TRGEN">
        <value caption="Hardware triggers are disabled. Starting a conversion is only possible by software." name="DIS" value="0"/>
        <value caption="Hardware trigger selected by TRGSEL field is enabled." name="EN" value="1"/>
      </value-group>
      <value-group caption="" name="AFEC_MR__TRGSEL">
        <value caption="AFE0_ADTRG for AFEC0 / AFE1_ADTRG for AFEC1" name="AFEC_TRIG0" value="0x0"/>
        <value caption="TIOA Output of the Timer Counter Channel 0 for AFEC0/TIOA Output of the Timer Counter Channel 3 for AFEC1" name="AFEC_TRIG1" value="0x1"/>
        <value caption="TIOA Output of the Timer Counter Channel 1 for AFEC0/TIOA Output of the Timer Counter Channel 4 for AFEC1" name="AFEC_TRIG2" value="0x2"/>
        <value caption="TIOA Output of the Timer Counter Channel 2 for AFEC0/TIOA Output of the Timer Counter Channel 5 for AFEC1" name="AFEC_TRIG3" value="0x3"/>
        <value caption="PWM0 event line 0 for AFEC0 / PWM1 event line 0 for AFEC1" name="AFEC_TRIG4" value="0x4"/>
        <value caption="PWM0 event line 1 for AFEC0 / PWM1 event line 1 for AFEC1" name="AFEC_TRIG5" value="0x5"/>
        <value caption="Analog Comparator" name="AFEC_TRIG6" value="0x6"/>
      </value-group>
