Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAMV70Q20.xml
        <register caption="PWM Event Line 0 Mode Register 2" name="PWM_ELMR2" offset="0x84" rw="RW" size="4">
          <bitfield caption="Comparison 0 Selection" mask="0x00000001" name="CSEL0"/>
          <bitfield caption="Comparison 1 Selection" mask="0x00000002" name="CSEL1"/>
          <bitfield caption="Comparison 2 Selection" mask="0x00000004" name="CSEL2"/>
          <bitfield caption="Comparison 3 Selection" mask="0x00000008" name="CSEL3"/>
          <bitfield caption="Comparison 4 Selection" mask="0x00000010" name="CSEL4"/>
          <bitfield caption="Comparison 5 Selection" mask="0x00000020" name="CSEL5"/>
          <bitfield caption="Comparison 6 Selection" mask="0x00000040" name="CSEL6"/>
          <bitfield caption="Comparison 7 Selection" mask="0x00000080" name="CSEL7"/>
        </register>
        <register caption="PWM Event Line 0 Mode Register 3" name="PWM_ELMR3" offset="0x88" rw="RW" size="4">
          <bitfield caption="Comparison 0 Selection" mask="0x00000001" name="CSEL0"/>
          <bitfield caption="Comparison 1 Selection" mask="0x00000002" name="CSEL1"/>
          <bitfield caption="Comparison 2 Selection" mask="0x00000004" name="CSEL2"/>
          <bitfield caption="Comparison 3 Selection" mask="0x00000008" name="CSEL3"/>
          <bitfield caption="Comparison 4 Selection" mask="0x00000010" name="CSEL4"/>
          <bitfield caption="Comparison 5 Selection" mask="0x00000020" name="CSEL5"/>
          <bitfield caption="Comparison 6 Selection" mask="0x00000040" name="CSEL6"/>
          <bitfield caption="Comparison 7 Selection" mask="0x00000080" name="CSEL7"/>
        </register>
        <register caption="PWM Event Line 0 Mode Register 4" name="PWM_ELMR4" offset="0x8C" rw="RW" size="4">
          <bitfield caption="Comparison 0 Selection" mask="0x00000001" name="CSEL0"/>
          <bitfield caption="Comparison 1 Selection" mask="0x00000002" name="CSEL1"/>
          <bitfield caption="Comparison 2 Selection" mask="0x00000004" name="CSEL2"/>
          <bitfield caption="Comparison 3 Selection" mask="0x00000008" name="CSEL3"/>
          <bitfield caption="Comparison 4 Selection" mask="0x00000010" name="CSEL4"/>
          <bitfield caption="Comparison 5 Selection" mask="0x00000020" name="CSEL5"/>
          <bitfield caption="Comparison 6 Selection" mask="0x00000040" name="CSEL6"/>
          <bitfield caption="Comparison 7 Selection" mask="0x00000080" name="CSEL7"/>
        </register>
        <register caption="PWM Event Line 0 Mode Register 5" name="PWM_ELMR5" offset="0x90" rw="RW" size="4">
          <bitfield caption="Comparison 0 Selection" mask="0x00000001" name="CSEL0"/>
          <bitfield caption="Comparison 1 Selection" mask="0x00000002" name="CSEL1"/>
          <bitfield caption="Comparison 2 Selection" mask="0x00000004" name="CSEL2"/>
          <bitfield caption="Comparison 3 Selection" mask="0x00000008" name="CSEL3"/>
          <bitfield caption="Comparison 4 Selection" mask="0x00000010" name="CSEL4"/>
          <bitfield caption="Comparison 5 Selection" mask="0x00000020" name="CSEL5"/>
          <bitfield caption="Comparison 6 Selection" mask="0x00000040" name="CSEL6"/>
          <bitfield caption="Comparison 7 Selection" mask="0x00000080" name="CSEL7"/>
        </register>
        <register caption="PWM Event Line 0 Mode Register 6" name="PWM_ELMR6" offset="0x94" rw="RW" size="4">
          <bitfield caption="Comparison 0 Selection" mask="0x00000001" name="CSEL0"/>
          <bitfield caption="Comparison 1 Selection" mask="0x00000002" name="CSEL1"/>
          <bitfield caption="Comparison 2 Selection" mask="0x00000004" name="CSEL2"/>
          <bitfield caption="Comparison 3 Selection" mask="0x00000008" name="CSEL3"/>
          <bitfield caption="Comparison 4 Selection" mask="0x00000010" name="CSEL4"/>
          <bitfield caption="Comparison 5 Selection" mask="0x00000020" name="CSEL5"/>
          <bitfield caption="Comparison 6 Selection" mask="0x00000040" name="CSEL6"/>
          <bitfield caption="Comparison 7 Selection" mask="0x00000080" name="CSEL7"/>
        </register>
        <register caption="PWM Event Line 0 Mode Register 7" name="PWM_ELMR7" offset="0x98" rw="RW" size="4">
          <bitfield caption="Comparison 0 Selection" mask="0x00000001" name="CSEL0"/>
          <bitfield caption="Comparison 1 Selection" mask="0x00000002" name="CSEL1"/>
          <bitfield caption="Comparison 2 Selection" mask="0x00000004" name="CSEL2"/>
          <bitfield caption="Comparison 3 Selection" mask="0x00000008" name="CSEL3"/>
          <bitfield caption="Comparison 4 Selection" mask="0x00000010" name="CSEL4"/>
          <bitfield caption="Comparison 5 Selection" mask="0x00000020" name="CSEL5"/>
          <bitfield caption="Comparison 6 Selection" mask="0x00000040" name="CSEL6"/>
          <bitfield caption="Comparison 7 Selection" mask="0x00000080" name="CSEL7"/>
        </register>
        <register caption="PWM Spread Spectrum Register" name="PWM_SSPR" offset="0xA0" rw="RW" size="4">
          <bitfield caption="Spread Spectrum Limit Value" mask="0x00FFFFFF" name="SPRD"/>
          <bitfield caption="Spread Spectrum Counter Mode" mask="0x01000000" name="SPRDM"/>
        </register>
        <register caption="PWM Spread Spectrum Update Register" name="PWM_SSPUP" offset="0xA4" rw="W" size="4">
          <bitfield caption="Spread Spectrum Limit Value Update" mask="0x00FFFFFF" name="SPRDUP"/>
        </register>
        <register caption="PWM Stepper Motor Mode Register" name="PWM_SMMR" offset="0xB0" rw="RW" size="4">
          <bitfield caption="Gray Count ENable" mask="0x00000001" name="GCEN0"/>
          <bitfield caption="Gray Count ENable" mask="0x00000002" name="GCEN1"/>
          <bitfield caption="DOWN Count" mask="0x00010000" name="DOWN0"/>
          <bitfield caption="DOWN Count" mask="0x00020000" name="DOWN1"/>
        </register>
        <register caption="PWM Fault Protection Value 2 Register" name="PWM_FPV2" offset="0xC0" rw="RW" size="4">
          <bitfield caption="Fault Protection to Hi-Z for PWMH output on channel 0" mask="0x00000001" name="FPZH0"/>
          <bitfield caption="Fault Protection to Hi-Z for PWMH output on channel 1" mask="0x00000002" name="FPZH1"/>
          <bitfield caption="Fault Protection to Hi-Z for PWMH output on channel 2" mask="0x00000004" name="FPZH2"/>
          <bitfield caption="Fault Protection to Hi-Z for PWMH output on channel 3" mask="0x00000008" name="FPZH3"/>
          <bitfield caption="Fault Protection to Hi-Z for PWML output on channel 0" mask="0x00010000" name="FPZL0"/>
          <bitfield caption="Fault Protection to Hi-Z for PWML output on channel 1" mask="0x00020000" name="FPZL1"/>
          <bitfield caption="Fault Protection to Hi-Z for PWML output on channel 2" mask="0x00040000" name="FPZL2"/>
          <bitfield caption="Fault Protection to Hi-Z for PWML output on channel 3" mask="0x00080000" name="FPZL3"/>
        </register>
        <register caption="PWM Write Protection Control Register" name="PWM_WPCR" offset="0xE4" rw="W" size="4">
          <bitfield caption="Write Protection Command" mask="0x00000003" name="WPCMD" values="PWM_WPCR__WPCMD"/>
          <bitfield caption="Write Protection Register Group 0" mask="0x00000004" name="WPRG0"/>
          <bitfield caption="Write Protection Register Group 1" mask="0x00000008" name="WPRG1"/>
          <bitfield caption="Write Protection Register Group 2" mask="0x00000010" name="WPRG2"/>
          <bitfield caption="Write Protection Register Group 3" mask="0x00000020" name="WPRG3"/>
          <bitfield caption="Write Protection Register Group 4" mask="0x00000040" name="WPRG4"/>
          <bitfield caption="Write Protection Register Group 5" mask="0x00000080" name="WPRG5"/>
          <bitfield caption="Write Protection Key" mask="0xFFFFFF00" name="WPKEY" values="PWM_WPCR__WPKEY"/>
        </register>
