Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAMV70Q20.xml
        <register caption="Device Frame Number Register" name="USBHS_DEVFNUM" offset="0x0020" rw="R" size="4">
          <bitfield caption="Micro Frame Number" mask="0x00000007" name="MFNUM"/>
          <bitfield caption="Frame Number" mask="0x00003FF8" name="FNUM"/>
          <bitfield caption="Frame Number CRC Error" mask="0x00008000" name="FNCERR"/>
        </register>
        <register caption="Device Endpoint Configuration Register (n = 0) 0" name="USBHS_DEVEPTCFG0" offset="0x100" rw="RW" size="4">
          <bitfield caption="Endpoint Memory Allocate" mask="0x00000002" name="ALLOC"/>
          <bitfield caption="Endpoint Banks" mask="0x0000000C" name="EPBK" values="USBHS_DEVEPTCFG__EPBK"/>
          <bitfield caption="Endpoint Size" mask="0x00000070" name="EPSIZE" values="USBHS_DEVEPTCFG__EPSIZE"/>
          <bitfield caption="Endpoint Direction" mask="0x00000100" name="EPDIR" values="USBHS_DEVEPTCFG__EPDIR"/>
          <bitfield caption="Automatic Switch" mask="0x00000200" name="AUTOSW"/>
          <bitfield caption="Endpoint Type" mask="0x00001800" name="EPTYPE" values="USBHS_DEVEPTCFG__EPTYPE"/>
          <bitfield caption="Number of transactions per microframe for isochronous endpoint" mask="0x00006000" name="NBTRANS" values="USBHS_DEVEPTCFG__NBTRANS"/>
        </register>
        <register caption="Device Endpoint Configuration Register (n = 0) 1" name="USBHS_DEVEPTCFG1" offset="0x104" rw="RW" size="4">
          <bitfield caption="Endpoint Memory Allocate" mask="0x00000002" name="ALLOC"/>
          <bitfield caption="Endpoint Banks" mask="0x0000000C" name="EPBK" values="USBHS_DEVEPTCFG__EPBK"/>
          <bitfield caption="Endpoint Size" mask="0x00000070" name="EPSIZE" values="USBHS_DEVEPTCFG__EPSIZE"/>
          <bitfield caption="Endpoint Direction" mask="0x00000100" name="EPDIR" values="USBHS_DEVEPTCFG__EPDIR"/>
          <bitfield caption="Automatic Switch" mask="0x00000200" name="AUTOSW"/>
          <bitfield caption="Endpoint Type" mask="0x00001800" name="EPTYPE" values="USBHS_DEVEPTCFG__EPTYPE"/>
          <bitfield caption="Number of transactions per microframe for isochronous endpoint" mask="0x00006000" name="NBTRANS" values="USBHS_DEVEPTCFG__NBTRANS"/>
        </register>
        <register caption="Device Endpoint Configuration Register (n = 0) 2" name="USBHS_DEVEPTCFG2" offset="0x108" rw="RW" size="4">
          <bitfield caption="Endpoint Memory Allocate" mask="0x00000002" name="ALLOC"/>
          <bitfield caption="Endpoint Banks" mask="0x0000000C" name="EPBK" values="USBHS_DEVEPTCFG__EPBK"/>
          <bitfield caption="Endpoint Size" mask="0x00000070" name="EPSIZE" values="USBHS_DEVEPTCFG__EPSIZE"/>
          <bitfield caption="Endpoint Direction" mask="0x00000100" name="EPDIR" values="USBHS_DEVEPTCFG__EPDIR"/>
          <bitfield caption="Automatic Switch" mask="0x00000200" name="AUTOSW"/>
          <bitfield caption="Endpoint Type" mask="0x00001800" name="EPTYPE" values="USBHS_DEVEPTCFG__EPTYPE"/>
          <bitfield caption="Number of transactions per microframe for isochronous endpoint" mask="0x00006000" name="NBTRANS" values="USBHS_DEVEPTCFG__NBTRANS"/>
        </register>
        <register caption="Device Endpoint Configuration Register (n = 0) 3" name="USBHS_DEVEPTCFG3" offset="0x10C" rw="RW" size="4">
          <bitfield caption="Endpoint Memory Allocate" mask="0x00000002" name="ALLOC"/>
          <bitfield caption="Endpoint Banks" mask="0x0000000C" name="EPBK" values="USBHS_DEVEPTCFG__EPBK"/>
          <bitfield caption="Endpoint Size" mask="0x00000070" name="EPSIZE" values="USBHS_DEVEPTCFG__EPSIZE"/>
          <bitfield caption="Endpoint Direction" mask="0x00000100" name="EPDIR" values="USBHS_DEVEPTCFG__EPDIR"/>
          <bitfield caption="Automatic Switch" mask="0x00000200" name="AUTOSW"/>
          <bitfield caption="Endpoint Type" mask="0x00001800" name="EPTYPE" values="USBHS_DEVEPTCFG__EPTYPE"/>
          <bitfield caption="Number of transactions per microframe for isochronous endpoint" mask="0x00006000" name="NBTRANS" values="USBHS_DEVEPTCFG__NBTRANS"/>
        </register>
        <register caption="Device Endpoint Configuration Register (n = 0) 4" name="USBHS_DEVEPTCFG4" offset="0x110" rw="RW" size="4">
          <bitfield caption="Endpoint Memory Allocate" mask="0x00000002" name="ALLOC"/>
          <bitfield caption="Endpoint Banks" mask="0x0000000C" name="EPBK" values="USBHS_DEVEPTCFG__EPBK"/>
          <bitfield caption="Endpoint Size" mask="0x00000070" name="EPSIZE" values="USBHS_DEVEPTCFG__EPSIZE"/>
          <bitfield caption="Endpoint Direction" mask="0x00000100" name="EPDIR" values="USBHS_DEVEPTCFG__EPDIR"/>
          <bitfield caption="Automatic Switch" mask="0x00000200" name="AUTOSW"/>
          <bitfield caption="Endpoint Type" mask="0x00001800" name="EPTYPE" values="USBHS_DEVEPTCFG__EPTYPE"/>
          <bitfield caption="Number of transactions per microframe for isochronous endpoint" mask="0x00006000" name="NBTRANS" values="USBHS_DEVEPTCFG__NBTRANS"/>
        </register>
        <register caption="Device Endpoint Configuration Register (n = 0) 5" name="USBHS_DEVEPTCFG5" offset="0x114" rw="RW" size="4">
          <bitfield caption="Endpoint Memory Allocate" mask="0x00000002" name="ALLOC"/>
          <bitfield caption="Endpoint Banks" mask="0x0000000C" name="EPBK" values="USBHS_DEVEPTCFG__EPBK"/>
          <bitfield caption="Endpoint Size" mask="0x00000070" name="EPSIZE" values="USBHS_DEVEPTCFG__EPSIZE"/>
          <bitfield caption="Endpoint Direction" mask="0x00000100" name="EPDIR" values="USBHS_DEVEPTCFG__EPDIR"/>
          <bitfield caption="Automatic Switch" mask="0x00000200" name="AUTOSW"/>
          <bitfield caption="Endpoint Type" mask="0x00001800" name="EPTYPE" values="USBHS_DEVEPTCFG__EPTYPE"/>
          <bitfield caption="Number of transactions per microframe for isochronous endpoint" mask="0x00006000" name="NBTRANS" values="USBHS_DEVEPTCFG__NBTRANS"/>
        </register>
        <register caption="Device Endpoint Configuration Register (n = 0) 6" name="USBHS_DEVEPTCFG6" offset="0x118" rw="RW" size="4">
          <bitfield caption="Endpoint Memory Allocate" mask="0x00000002" name="ALLOC"/>
          <bitfield caption="Endpoint Banks" mask="0x0000000C" name="EPBK" values="USBHS_DEVEPTCFG__EPBK"/>
          <bitfield caption="Endpoint Size" mask="0x00000070" name="EPSIZE" values="USBHS_DEVEPTCFG__EPSIZE"/>
          <bitfield caption="Endpoint Direction" mask="0x00000100" name="EPDIR" values="USBHS_DEVEPTCFG__EPDIR"/>
          <bitfield caption="Automatic Switch" mask="0x00000200" name="AUTOSW"/>
          <bitfield caption="Endpoint Type" mask="0x00001800" name="EPTYPE" values="USBHS_DEVEPTCFG__EPTYPE"/>
          <bitfield caption="Number of transactions per microframe for isochronous endpoint" mask="0x00006000" name="NBTRANS" values="USBHS_DEVEPTCFG__NBTRANS"/>
        </register>
        <register caption="Device Endpoint Configuration Register (n = 0) 7" name="USBHS_DEVEPTCFG7" offset="0x11C" rw="RW" size="4">
          <bitfield caption="Endpoint Memory Allocate" mask="0x00000002" name="ALLOC"/>
          <bitfield caption="Endpoint Banks" mask="0x0000000C" name="EPBK" values="USBHS_DEVEPTCFG__EPBK"/>
          <bitfield caption="Endpoint Size" mask="0x00000070" name="EPSIZE" values="USBHS_DEVEPTCFG__EPSIZE"/>
          <bitfield caption="Endpoint Direction" mask="0x00000100" name="EPDIR" values="USBHS_DEVEPTCFG__EPDIR"/>
          <bitfield caption="Automatic Switch" mask="0x00000200" name="AUTOSW"/>
          <bitfield caption="Endpoint Type" mask="0x00001800" name="EPTYPE" values="USBHS_DEVEPTCFG__EPTYPE"/>
          <bitfield caption="Number of transactions per microframe for isochronous endpoint" mask="0x00006000" name="NBTRANS" values="USBHS_DEVEPTCFG__NBTRANS"/>
        </register>
        <register caption="Device Endpoint Configuration Register (n = 0) 8" name="USBHS_DEVEPTCFG8" offset="0x120" rw="RW" size="4">
          <bitfield caption="Endpoint Memory Allocate" mask="0x00000002" name="ALLOC"/>
          <bitfield caption="Endpoint Banks" mask="0x0000000C" name="EPBK" values="USBHS_DEVEPTCFG__EPBK"/>
          <bitfield caption="Endpoint Size" mask="0x00000070" name="EPSIZE" values="USBHS_DEVEPTCFG__EPSIZE"/>
          <bitfield caption="Endpoint Direction" mask="0x00000100" name="EPDIR" values="USBHS_DEVEPTCFG__EPDIR"/>
          <bitfield caption="Automatic Switch" mask="0x00000200" name="AUTOSW"/>
          <bitfield caption="Endpoint Type" mask="0x00001800" name="EPTYPE" values="USBHS_DEVEPTCFG__EPTYPE"/>
          <bitfield caption="Number of transactions per microframe for isochronous endpoint" mask="0x00006000" name="NBTRANS" values="USBHS_DEVEPTCFG__NBTRANS"/>
        </register>
        <register caption="Device Endpoint Configuration Register (n = 0) 9" name="USBHS_DEVEPTCFG9" offset="0x124" rw="RW" size="4">
          <bitfield caption="Endpoint Memory Allocate" mask="0x00000002" name="ALLOC"/>
          <bitfield caption="Endpoint Banks" mask="0x0000000C" name="EPBK" values="USBHS_DEVEPTCFG__EPBK"/>
          <bitfield caption="Endpoint Size" mask="0x00000070" name="EPSIZE" values="USBHS_DEVEPTCFG__EPSIZE"/>
          <bitfield caption="Endpoint Direction" mask="0x00000100" name="EPDIR" values="USBHS_DEVEPTCFG__EPDIR"/>
          <bitfield caption="Automatic Switch" mask="0x00000200" name="AUTOSW"/>
          <bitfield caption="Endpoint Type" mask="0x00001800" name="EPTYPE" values="USBHS_DEVEPTCFG__EPTYPE"/>
          <bitfield caption="Number of transactions per microframe for isochronous endpoint" mask="0x00006000" name="NBTRANS" values="USBHS_DEVEPTCFG__NBTRANS"/>
        </register>
        <register caption="Device Endpoint Status Register (n = 0) 0" name="USBHS_DEVEPTISR0" offset="0x130" rw="R" size="4">
          <bitfield caption="Transmitted IN Data Interrupt" mask="0x00000001" name="TXINI"/>
          <bitfield caption="Received OUT Data Interrupt" mask="0x00000002" name="RXOUTI"/>
          <bitfield caption="Received SETUP Interrupt" mask="0x00000004" name="RXSTPI"/>
          <bitfield caption="NAKed OUT Interrupt" mask="0x00000008" name="NAKOUTI"/>
          <bitfield caption="NAKed IN Interrupt" mask="0x00000010" name="NAKINI"/>
          <bitfield caption="Overflow Interrupt" mask="0x00000020" name="OVERFI"/>
          <bitfield caption="STALLed Interrupt" mask="0x00000040" name="STALLEDI"/>
          <bitfield caption="Short Packet Interrupt" mask="0x00000080" name="SHORTPACKET"/>
          <bitfield caption="Data Toggle Sequence" mask="0x00000300" name="DTSEQ" values="USBHS_DEVEPTISR__DTSEQ"/>
          <bitfield caption="Number of Busy Banks" mask="0x00003000" name="NBUSYBK" values="USBHS_DEVEPTISR__NBUSYBK"/>
          <bitfield caption="Current Bank" mask="0x0000C000" name="CURRBK" values="USBHS_DEVEPTISR__CURRBK"/>
          <bitfield caption="Read/Write Allowed" mask="0x00010000" name="RWALL"/>
          <bitfield caption="Control Direction" mask="0x00020000" name="CTRLDIR"/>
          <bitfield caption="Configuration OK Status" mask="0x00040000" name="CFGOK"/>
          <bitfield caption="Byte Count" mask="0x7FF00000" name="BYCT"/>
        </register>
        <register caption="Device Endpoint Status Register (n = 0) 1" name="USBHS_DEVEPTISR1" offset="0x134" rw="R" size="4">
          <bitfield caption="Transmitted IN Data Interrupt" mask="0x00000001" name="TXINI"/>
          <bitfield caption="Received OUT Data Interrupt" mask="0x00000002" name="RXOUTI"/>
          <bitfield caption="Received SETUP Interrupt" mask="0x00000004" name="RXSTPI"/>
          <bitfield caption="NAKed OUT Interrupt" mask="0x00000008" name="NAKOUTI"/>
          <bitfield caption="NAKed IN Interrupt" mask="0x00000010" name="NAKINI"/>
          <bitfield caption="Overflow Interrupt" mask="0x00000020" name="OVERFI"/>
          <bitfield caption="STALLed Interrupt" mask="0x00000040" name="STALLEDI"/>
          <bitfield caption="Short Packet Interrupt" mask="0x00000080" name="SHORTPACKET"/>
          <bitfield caption="Data Toggle Sequence" mask="0x00000300" name="DTSEQ" values="USBHS_DEVEPTISR__DTSEQ"/>
          <bitfield caption="Number of Busy Banks" mask="0x00003000" name="NBUSYBK" values="USBHS_DEVEPTISR__NBUSYBK"/>
          <bitfield caption="Current Bank" mask="0x0000C000" name="CURRBK" values="USBHS_DEVEPTISR__CURRBK"/>
          <bitfield caption="Read/Write Allowed" mask="0x00010000" name="RWALL"/>
          <bitfield caption="Control Direction" mask="0x00020000" name="CTRLDIR"/>
          <bitfield caption="Configuration OK Status" mask="0x00040000" name="CFGOK"/>
          <bitfield caption="Byte Count" mask="0x7FF00000" name="BYCT"/>
        </register>
        <register caption="Device Endpoint Status Register (n = 0) 2" name="USBHS_DEVEPTISR2" offset="0x138" rw="R" size="4">
          <bitfield caption="Transmitted IN Data Interrupt" mask="0x00000001" name="TXINI"/>
          <bitfield caption="Received OUT Data Interrupt" mask="0x00000002" name="RXOUTI"/>
          <bitfield caption="Received SETUP Interrupt" mask="0x00000004" name="RXSTPI"/>
          <bitfield caption="NAKed OUT Interrupt" mask="0x00000008" name="NAKOUTI"/>
          <bitfield caption="NAKed IN Interrupt" mask="0x00000010" name="NAKINI"/>
          <bitfield caption="Overflow Interrupt" mask="0x00000020" name="OVERFI"/>
          <bitfield caption="STALLed Interrupt" mask="0x00000040" name="STALLEDI"/>
          <bitfield caption="Short Packet Interrupt" mask="0x00000080" name="SHORTPACKET"/>
          <bitfield caption="Data Toggle Sequence" mask="0x00000300" name="DTSEQ" values="USBHS_DEVEPTISR__DTSEQ"/>
          <bitfield caption="Number of Busy Banks" mask="0x00003000" name="NBUSYBK" values="USBHS_DEVEPTISR__NBUSYBK"/>
          <bitfield caption="Current Bank" mask="0x0000C000" name="CURRBK" values="USBHS_DEVEPTISR__CURRBK"/>
          <bitfield caption="Read/Write Allowed" mask="0x00010000" name="RWALL"/>
          <bitfield caption="Control Direction" mask="0x00020000" name="CTRLDIR"/>
          <bitfield caption="Configuration OK Status" mask="0x00040000" name="CFGOK"/>
          <bitfield caption="Byte Count" mask="0x7FF00000" name="BYCT"/>
        </register>
        <register caption="Device Endpoint Status Register (n = 0) 3" name="USBHS_DEVEPTISR3" offset="0x13C" rw="R" size="4">
          <bitfield caption="Transmitted IN Data Interrupt" mask="0x00000001" name="TXINI"/>
          <bitfield caption="Received OUT Data Interrupt" mask="0x00000002" name="RXOUTI"/>
          <bitfield caption="Received SETUP Interrupt" mask="0x00000004" name="RXSTPI"/>
          <bitfield caption="NAKed OUT Interrupt" mask="0x00000008" name="NAKOUTI"/>
          <bitfield caption="NAKed IN Interrupt" mask="0x00000010" name="NAKINI"/>
          <bitfield caption="Overflow Interrupt" mask="0x00000020" name="OVERFI"/>
          <bitfield caption="STALLed Interrupt" mask="0x00000040" name="STALLEDI"/>
          <bitfield caption="Short Packet Interrupt" mask="0x00000080" name="SHORTPACKET"/>
          <bitfield caption="Data Toggle Sequence" mask="0x00000300" name="DTSEQ" values="USBHS_DEVEPTISR__DTSEQ"/>
          <bitfield caption="Number of Busy Banks" mask="0x00003000" name="NBUSYBK" values="USBHS_DEVEPTISR__NBUSYBK"/>
          <bitfield caption="Current Bank" mask="0x0000C000" name="CURRBK" values="USBHS_DEVEPTISR__CURRBK"/>
          <bitfield caption="Read/Write Allowed" mask="0x00010000" name="RWALL"/>
          <bitfield caption="Control Direction" mask="0x00020000" name="CTRLDIR"/>
          <bitfield caption="Configuration OK Status" mask="0x00040000" name="CFGOK"/>
          <bitfield caption="Byte Count" mask="0x7FF00000" name="BYCT"/>
        </register>
        <register caption="Device Endpoint Status Register (n = 0) 4" name="USBHS_DEVEPTISR4" offset="0x140" rw="R" size="4">
          <bitfield caption="Transmitted IN Data Interrupt" mask="0x00000001" name="TXINI"/>
          <bitfield caption="Received OUT Data Interrupt" mask="0x00000002" name="RXOUTI"/>
          <bitfield caption="Received SETUP Interrupt" mask="0x00000004" name="RXSTPI"/>
          <bitfield caption="NAKed OUT Interrupt" mask="0x00000008" name="NAKOUTI"/>
          <bitfield caption="NAKed IN Interrupt" mask="0x00000010" name="NAKINI"/>
          <bitfield caption="Overflow Interrupt" mask="0x00000020" name="OVERFI"/>
          <bitfield caption="STALLed Interrupt" mask="0x00000040" name="STALLEDI"/>
          <bitfield caption="Short Packet Interrupt" mask="0x00000080" name="SHORTPACKET"/>
          <bitfield caption="Data Toggle Sequence" mask="0x00000300" name="DTSEQ" values="USBHS_DEVEPTISR__DTSEQ"/>
          <bitfield caption="Number of Busy Banks" mask="0x00003000" name="NBUSYBK" values="USBHS_DEVEPTISR__NBUSYBK"/>
          <bitfield caption="Current Bank" mask="0x0000C000" name="CURRBK" values="USBHS_DEVEPTISR__CURRBK"/>
          <bitfield caption="Read/Write Allowed" mask="0x00010000" name="RWALL"/>
          <bitfield caption="Control Direction" mask="0x00020000" name="CTRLDIR"/>
          <bitfield caption="Configuration OK Status" mask="0x00040000" name="CFGOK"/>
          <bitfield caption="Byte Count" mask="0x7FF00000" name="BYCT"/>
        </register>
